### Handle Categorical Features

### One Hot Encoding

In [23]:
import pandas as pd

In [34]:
df = pd.read_csv("C:\\Users\\Dell\\Downloads\\titanic.csv",usecols=["Sex"])

In [35]:
df.columns

Index(['Sex'], dtype='object')

In [36]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [37]:
pd.get_dummies(df["Sex"],drop_first=True).astype("int")

     male
0       1
1       0
2       0
3       0
4       1
..    ...
886     1
887     0
888     0
889     1
890     1

[891 rows x 1 columns]

In [39]:
df = pd.read_csv("C:\\Users\\Dell\\Downloads\\titanic.csv",usecols=["Embarked"])
df["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [49]:
df.dropna(inplace=True)

In [44]:
pd.get_dummies(df,drop_first=True).astype("int")

     Embarked_Q  Embarked_S
0             0           1
1             0           0
2             0           1
3             0           1
4             0           1
..          ...         ...
886           0           1
887           0           1
888           0           1
889           0           0
890           1           0

[889 rows x 2 columns]